Revit 2020 API
AdvancedMetal Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class AdvancedMetal
Visual Basic
Public NotInheritable Class AdvancedMetal
Visual C++
public ref class AdvancedMetal abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AdvancedMetal
See Also
AdvancedMetal Members
Autodesk.Revit.DB.Visual Namespace